app/controllers/admin/users_controller.rb

SELECT * FROM "users" LIMIT 30 OFFSET 0
SELECT count(*) AS count_all FROM "users"
---
  def index
    @users = User.paginate :all, :page => params[:page]

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def show
    @user = User.find(params[:id])