app/controllers/projects_controller.rb

SELECT * FROM "projects" WHERE ("projects"."id" = 1)
---
  def show
    @project = Project.find(params[:id])

SELECT * FROM "projects" WHERE ("projects"."id" = 1)
---
  def edit
    @project = Project.find(params[:id])

INSERT INTO "projects" ("name", "uri", "created_at", "updated_at") VALUES('Projeto 1', 'projeto1', '2009-02-16 18:36:38', '2009-02-16 18:36:38')
---
  def create
    @project = Project.new(params[:project])
    @project.user = current_user

    respond_to do |format|
      if @project.save