app/controllers/project_users_controller.rb

  def index
    project_id = params[:pid]
    @project = Project.find_by_id(project_id)
    @project_users = ProjectUser.find(:all, :conditions => ["project_id = ?", project_id])
---
SELECT * FROM "projects" WHERE ("projects"."id" = '1') LIMIT 1
SELECT * FROM "project_users" WHERE (project_id = 1)
SELECT * FROM "users" WHERE ("users"."id" = 2) LIMIT 1

  def edit
    @project = Project.find_by_id(params[:id])
    @users = User.find(:all)
    @project_users = ProjectUser.find(:all, :conditions => ["project_id = ?", @project.id])
---
SELECT * FROM "projects" WHERE ("projects"."id" IS NULL) LIMIT 1
SELECT * FROM "users" WHERE ("users"."id" = 2) LIMIT 1
SELECT * FROM "project_users" WHERE (project_id = 1)

  def create
  	@project = Project.find_by_id(params[:pid])
    @users = User.find(:all)
    @project_users = ProjectUser.find(:all, :conditions => ["project_id = ?", @project.id])


		for user in @users
			is_checked = params["user_id#{user.id}"]
			if is_checked
				if !exist_in_list(@project_users, user)
					project_user = ProjectUser.new
					project_user.project_id = @project.id
					project_user.user_id = user.id
					project_user.user_type = params["user_type"][user.id.to_s]
					@project.project_users << project_user
				else
					project_user = get_project_user_by_user(@project_users, user)
					project_user.user_type = params["user_type"][user.id.to_s]
					project_user.save!
				end
			else
				project_user = ProjectUser.find(user.id)
				if !project_user.nil?
			    project_user.destroy
---
SELECT * FROM "projects" WHERE ("projects"."id" IS NULL) LIMIT 1
SELECT * FROM "project_users" WHERE ("project_users"."id" = 1)
INSERT INTO "project_users" ("created_at", "project_id", "updated_at", "user_type", "user_id") VALUES('2009-02-16 19:32:15', 1, '2009-02-16 19:32:15', 'PO', 1)
DELETE FROM "project_users" WHERE "id" = 1

  def destroy
    @project_user = ProjectUser.find(params[:id])
    @project_user.destroy
---
SELECT * FROM "project_users" WHERE ("project_users"."id" = 2)
DELETE FROM "project_users" WHERE "id" = 2